app/views/messages/new.html.erb

      <div class="select">
        <%= f.select :recipient_id, User.recipient_options(current_user) %>
---
SELECT "users".* FROM "users"