app/views/users/index.html.erb

  <tbody>
    <% User.all.each do |another_user| %>
---
SELECT "users".* FROM "users"