app/views/home/index.html.erb

SELECT "posts".* FROM "posts"
---
           <h3 class="title">Posts</h3>
              <%= render Post.all %>

SELECT "users".* FROM "users"
---
      <div class="box">
        <% User.all.each do |another_user| %>