app/views/posts/_post.html.erb

        </div>
        <%= post.likes.map {|e| e.user.email }.to_sentence %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

<h1 class="title">Posts</h1>
<%= render Post.all %>
---
SELECT "posts".* FROM "posts"