app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 8], ["friend_id", 5], ["created_at", "2017-08-13 09:31:18.178161"], ["updated_at", "2017-08-13 09:31:18.178161"]]
---
  def create
    #friendship_params[:user_id] == current_user.id
    current_user.friendships.create!(friendship_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def destroy
    another_user = User.find params[:user_id]