app/controllers/likes_controller.rb

  def toggle
    if params[:post_id]
      item = Post.find params[:post_id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]