app/controllers/messages_controller.rb

INSERT INTO "messages" ("sender_id", "recipient_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sender_id", 3], ["recipient_id", 2], ["body", "Hello"], ["created_at", "2017-08-12 11:50:51.779221"], ["updated_at", "2017-08-12 11:50:51.779221"]]
---
  def create
    @message = current_user.sent_messages.build message_params
    if @message.save