app/controllers/posts_controller.rb

INSERT INTO "posts" ("poster_id", "created_at", "updated_at", "body", "wall_user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["poster_id", 13], ["created_at", "2017-08-18 05:44:45.462054"], ["updated_at", "2017-08-18 05:44:45.462054"], ["body", "hi"], ["wall_user_id", 1]]
---
  def create
    @post = current_user.posts.build post_params

    if @post.save